app/controllers/lineitems_controller.rb

  def create
    #@lineitem = Lineitem.new(lineitem_params), we use our own build
    product = Product.find(params[:product_id])
    @lineitem = @cart.add_item(product.id)
    respond_to do |format|
      if @lineitem.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-12-07 20:10:11.127849"], ["updated_at", "2021-12-07 20:10:11.127849"]]
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["cart_id", 7], ["created_at", "2021-12-08 07:08:21.445300"], ["updated_at", "2021-12-08 07:08:21.445300"]]
UPDATE "lineitems" SET "updated_at" = ?, "quantity" = ? WHERE "lineitems"."id" = ?  [["updated_at", "2021-12-08 07:08:30.173906"], ["quantity", 2], ["id", 1]]