app/controllers/orders_controller.rb

  def new
    if @cart.lineitems.empty?
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 4]]
SELECT 1 AS one FROM "lineitems" WHERE "lineitems"."cart_id" = ? LIMIT ?  [["cart_id", 8], ["LIMIT", 1]]

  def create
    @order = Order.new(order_params)
    @order.add_items_from_cart(@cart)
    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "paytype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "mira"], ["address", "8467 Seawind Way"], ["email", "msu2@scu.edu"], ["paytype", "Paypal"], ["created_at", "2021-12-08 07:09:15.290515"], ["updated_at", "2021-12-08 07:09:15.290515"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 8]]

  def update
    respond_to do |format|
      if @order.update(order_params)
---
UPDATE "orders" SET "address" = ?, "paytype" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["address", "1234 street"], ["paytype", "Credit Card"], ["updated_at", "2021-12-09 05:08:04.522811"], ["id", 15]]