app/controllers/products_controller.rb

UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 40.1], ["updated_at", "2021-12-08 23:51:52.219340"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)