app/controllers/shopper_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%#params[:search]}%')
---
  def index
    @products = Product.search(params[:q])