app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
  def index
    #@users = User.all
    @users = User.order(:name)