app/models/order.rb

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 4]]
---
  def add_items_from_cart(cart)
    cart.lineitems.each do |item|