app/models/product.rb

SELECT 1 AS one FROM "lineitems" WHERE "lineitems"."product_id" = ? LIMIT ?  [["product_id", 5], ["LIMIT", 1]]
---
  def make_sure_no_line_items
    if self.lineitems.empty?